-- Adminer 4.2.1 MySQL dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `ads`;
CREATE TABLE `ads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `seller_name` varchar(50) NOT NULL,
  `allow_mails` tinyint(4) NOT NULL,
  `phone` varchar(12) NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` text NOT NULL,
  `price` decimal(10,0) unsigned NOT NULL,
  `location_id` int(10) unsigned NOT NULL,
  `category_id` int(10) unsigned NOT NULL,
  `organization_form_id` int(10) unsigned NOT NULL,
  `email` varchar(100) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `ads` (`id`, `seller_name`, `allow_mails`, `phone`, `title`, `description`, `price`, `location_id`, `category_id`, `organization_form_id`, `email`) VALUES
(1,	'',	0,	'',	'aaaa',	'assdf',	100,	1,	285,	0,	''),
(2,	'',	0,	'',	'223232',	'23234',	2000,	1,	226,	0,	'');

DROP TABLE IF EXISTS `categories`;
CREATE TABLE `categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf16 NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

INSERT INTO `categories` (`id`, `name`, `parent_id`) VALUES
(109,	'Автомобили с пробегом',	100),
(199,	'Новые автомобили',	100),
(114,	'Мотоциклы и мототехника',	100),
(181,	'Грузовики и спецтехника',	100),
(111,	'Водный транспорт',	100),
(110,	'Запчасти и аксессуары',	100),
(224,	'Квартиры',	200),
(223,	'Комнаты',	200),
(225,	'Дома, дачи, коттеджи',	200),
(226,	'Земельные участки',	200),
(285,	'Гаражи и машиноместа',	200),
(242,	'Коммерческая недвижимость',	200),
(286,	'Недвижимость за рубежом',	200),
(311,	'Вакансии (поиск сотрудников)',	300),
(312,	'Резюме (поиск работы)',	300),
(414,	'Предложения услуг',	400),
(415,	'Запросы на услуги',	400),
(527,	'Одежда, обувь, аксессуары',	500),
(529,	'Детская одежда и обувь',	500),
(530,	'Товары для детей и игрушки',	500),
(528,	'Часы и украшения',	500),
(588,	'Красота и здоровье',	500),
(621,	'Бытовая техника',	600),
(620,	'Мебель и интерьер',	600),
(687,	'Посуда и товары для кухни',	600),
(682,	'Продукты питания',	600),
(619,	'Ремонт и строительство',	600),
(606,	'Растения',	600),
(732,	'Аудио и видео',	700),
(797,	'Игры, приставки и программы',	700),
(731,	'Настольные компьютеры',	700),
(798,	'Ноутбуки',	700),
(799,	'Оргтехника и расходники',	700),
(796,	'Планшеты и электронные книги',	700),
(784,	'Телефоны',	700),
(701,	'Товары для компьютера',	700),
(705,	'Фототехника',	700),
(833,	'Билеты и путешествия',	800),
(834,	'Велосипеды',	800),
(883,	'Книги и журналы',	800),
(836,	'Коллекционирование',	800),
(838,	'Музыкальные инструменты',	800),
(802,	'Охота и рыбалка',	800),
(839,	'Спорт и отдых',	800),
(803,	'Знакомства',	800),
(989,	'Собаки',	900),
(990,	'Кошки',	900),
(991,	'Птицы',	900),
(992,	'Аквариум',	900),
(993,	'Другие животные',	900),
(994,	'Товары для животных',	900),
(1016,	'Готовый бизнес',	1000),
(1040,	'Оборудование для бизнеса',	1000),
(100,	'Транспорт',	NULL),
(200,	'Недвижимость',	NULL),
(300,	'Работа',	NULL),
(400,	'Услуги',	NULL),
(500,	'Личные вещи',	NULL),
(600,	'Для дома и дачи',	NULL),
(700,	'Бытовая электроника',	NULL),
(800,	'Хобби и отдых',	NULL),
(900,	'Животные',	NULL),
(1000,	'Для бизнеса',	NULL);

DROP TABLE IF EXISTS `cities`;
CREATE TABLE `cities` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

INSERT INTO `cities` (`id`, `name`) VALUES
(1,	'---Выберите город---'),
(2,	'Новосибирск'),
(3,	'Барабинск'),
(4,	'Бердск'),
(5,	'Искитим'),
(6,	'Колывань'),
(7,	'Краснообск'),
(8,	'Куйбышев'),
(9,	'Мошково'),
(10,	'Обь'),
(11,	'Ордынское'),
(12,	'Черепаново');

-- 2015-06-25 05:16:42
